Revit 2024 API
BuiltInFailures.GeometryFailures.CurveDriverError Property
 Element's internal join data is corrupt.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CurveDriverError { get; }
Visual Basic
Public Shared ReadOnly Property CurveDriverError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CurveDriverError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.GeometryFailures Class
Autodesk.Revit.DB Namespace